In [10]:
import random
import pandas as pd

students = ['Abdoulaye','Adam','Adrian','Alejandra',
            'Angela','Anthony','Ashley','Beili',
            'Brooke','Cealin','Christina','Desiree',
            'Fraol','Gene','Hai','Jannette',
            'Jared','Joseph','Katherine','Leslie',
            'Mahdi','Marilou','Meakin','Michael',
            'Nabeel','Nicholas','Rebekah','Redeat',
            'Regina','Renier','Sam','Sandra',
            'Sree','Stephanie','Steven','Sveena',
            'Sylvester',
            'Taslemun','Thomas','Tolu','Tsegaye',
            'Valerie','William','Zenan']

assigned = [False for s in students]

group_size = 5

group_count = int(len(students)/group_size) + 1 
# need to fix to handle uneven groups
# the +1 is a workaround

group = {(i + 1):[] for i in range(group_count)}

while False in assigned:
    index = 0

    for s in students:

        i = random.randint(1,group_count)

        if assigned[index] == False:
            
            if(len(group[i]) < group_size):
                group[i].append(s)
                assigned[index] = True

        index = index + 1
    
group_df = pd.DataFrame(dict([(key,pd.Series(value)) for key,value in group.items()]))
group_df = pd.DataFrame.transpose(group_df)

group_df

           0          1          2         3          4
1  Abdoulaye     Adrian    Desiree    Redeat   Taslemun
2  Alejandra     Angela      Jared    Leslie    Michael
3      Beili   Jannette  Katherine   Marilou     Renier
4     Meakin        Sam  Sylvester     Zenan     Nabeel
5    Anthony  Christina      Mahdi    Steven     Thomas
6       Adam     Cealin     Regina   William  Stephanie
7     Ashley       Gene        Hai    Sandra       Sree
8     Joseph    Tsegaye    Valerie  Nicholas        NaN
9     Brooke      Fraol    Rebekah      Tolu     Sveena